fix(docs): use mermaid diagrams
